<?php

$lang['required'] = 'Поле %s обязательно для заполнения.';
$lang['isset'] = 'Поле %s должно содержать значение.';
$lang['valid_email'] = 'В поле %s должен быть введен корректный адрес электронной почты.';
$lang['valid_emails'] = 'В поле %s должны быть введены корректные адреса электронной почты.';
$lang['valid_url'] = 'В поле %s должна содержаться корректная ссылка.';
$lang['valid_ip'] = 'В поле %s должен содержаться корректный IP.';
$lang['min_length'] = 'Длина поля %s должна быть не меньше %s символов.';
$lang['max_length'] = 'Длина поля %s не может превышать %s символов.';
$lang['exact_length'] = 'Длина поля %s должна быть равной %s символам.';
$lang['alpha'] = 'Поле %s может содержать только символы алфавита.';
$lang['alpha_numeric'] = 'Поле %s может содержать только символы алфавита и цифры.';
$lang['alpha_dash'] = 'Поле %s может содержать только символы алфавита и цифры, подчеркивания и тире.';
$lang['numeric'] = 'Поле %s должно содержать только цифры.';
$lang['is_numeric'] = 'Поле %s должно содержать только числовые символы.';
$lang['integer'] = 'Поле %s должно содержать целое число.';
$lang['matches'] = 'Значение поля %s не совпадает со значением поля %s.';
$lang['is_natural'] = 'Поле %s должно содержать только положительные числа.';
$lang['is_natural_no_zero'] = 'Поле %s должно содержать только число больше нуля.';
?>