<?php

$lang['imglib_source_image_required'] = 'Укажите имя файла исходного изображения.';
$lang['imglib_gd_required'] = 'Для выполнения этой операции необходима библиотека GD.';
$lang['imglib_gd_required_for_props'] = 'На сервере должна быть установлена библиотека GD для получения значений свойств изображений.';
$lang['imglib_unsupported_imagecreate'] = 'На сервере отсутствует функция поддержки работы с данным типом изображения.';
$lang['imglib_gif_not_supported'] = 'Обычно поддержка изображений GIF отсутствует в связи с лицензионными ограничениями.  Вместо этого вы можете использовать JPG или PNG.';
$lang['imglib_jpg_not_supported'] = 'Не установлена поддержка JPG';
$lang['imglib_png_not_supported'] = 'Не установлена поддержка PNG';
$lang['imglib_jpg_or_png_required'] = 'Выбранная вами библиотека обработки изображений поддерживает только JPG или PNG-файлы.';
$lang['imglib_copy_error'] = 'Ошибка при попытке перезаписать файл.  Убедитесь, что директория с изображениями доступна для записи.';
$lang['imglib_rotate_unsupported'] = 'Поворот изображения не поддерживается сервером.';
$lang['imglib_libpath_invalid'] = 'Путь к библиотеке обработки изображений некорректен.  Пожалуйста, исправьте его.';
$lang['imglib_image_process_failed'] = 'Невозможно обработать изображение.  Убедитесь, что выбранный вами пакет для обработки изображений поддерживается сервером, а также правильность пути к этим пакетам.';
$lang['imglib_rotation_angle_required'] = 'Необходимо указать значение угла для осуществления поворота изображения.';
$lang['imglib_writing_failed_gif'] = 'Изображение GIF';
$lang['imglib_invalid_path'] = 'Путь к изображению некорректен.';
$lang['imglib_copy_failed'] = 'Невозможно выполнить функцию копирования файла изображения.';
$lang['imglib_missing_font'] = 'Шрифт не найден.';
$lang['imglib_save_failed'] = 'Невозможно сохранить изображение. Убедитесь, что файл изображения или директория с изображениями доступны для записи.';
?>