<?php

$lang['upload_userfile_not_set'] = 'Невозможно найти переменную userfile в данных, полученных из массива POST.';
$lang['upload_file_exceeds_limit'] = 'Загружаемый файл превышает ограничение в разрешенном размере файлов для загрузки на сервер.';
$lang['upload_file_exceeds_form_limit'] = 'Размер загружаемого файла превышает ограничение в разрешенном размере файлов, указанное в форме загрузки.';
$lang['upload_file_partial'] = 'Этот файл был частично загружен.';
$lang['upload_no_temp_directory'] = 'Отсутствует временная папка.';
$lang['upload_unable_to_write_file'] = 'Запись файла на диск не удалась.';
$lang['upload_stopped_by_extension'] = 'Загрузка файла остановлена по причине неверного расширения.';
$lang['upload_no_file_selected'] = 'Вы не выбрали файл для загрузки.';
$lang['upload_invalid_filetype'] = 'Вы пытаетесь загрузить запрещенный тип файла.';
$lang['upload_invalid_filesize'] = 'Файл, который вы пытаетесь загрузить, превышает ограничение в размере.';
$lang['upload_invalid_dimensions'] = 'Изображение, которое вы загружаете нарушает ограничение по ширине/высоте.';
$lang['upload_destination_error'] = 'Невозможно скопировать файл в указанное место после его загрузки.';
$lang['upload_no_filepath'] = 'Путь для загрузки файлов некорректен.';
$lang['upload_no_file_types'] = 'Вы не указали разрешенные типы файлов.';
$lang['upload_bad_filename'] = 'Файл, который вы загружаете уже находится на сервере.';
$lang['upload_not_writable'] = 'Директория для загрузки файлов скорее всего не имеет прав на запись.';
?>